app/controllers/comments_controller.rb

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
INSERT INTO "comments" ("updated_at", "title", "body", "post_id", "created_at") VALUES('2009-03-18 13:58:32', 'title', 'body', 1, '2009-03-18 13:58:32')
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.new(params[:comment])
    if @comment.save

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
SELECT * FROM "comments" WHERE ("comments"."id" = 1)
DELETE FROM "comments" WHERE "id" = 1
---
  def destroy
    @post = Post.find(params[:post_id])
    @comment = Comment.find(params[:id])
    @comment.destroy