app/controllers/posts_controller.rb

SELECT * FROM "posts" WHERE ("posts"."published" = 't') ORDER BY created_at desc
---
  def index
    @posts = Post.find( :all, :conditions=> {:published => true}, :order => 'created_at desc')