app/controllers/posts_controller.rb

  def index
    @posts = Post.latest
---
SELECT * FROM "posts" ORDER BY created_at desc

  def create
    @post = Post.new(params[:post])
    if @post.save
---
INSERT INTO "posts" ("updated_at", "title", "body", "published", "author", "created_at") VALUES('2009-03-18 13:58:33', 'Test Title', 'Test Body', 'f', NULL, '2009-03-18 13:58:33')

  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(params[:post])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
UPDATE "posts" SET "title" = 'New Title', "body" = 'New Body', "updated_at" = '2009-03-18 13:58:33' WHERE "id" = 1